RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_cmp.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_cmp.c
 **
 ** A detailed description is available at
 ** @link CmpGroup CMP @endlink
 **
 **   - 2018-10-22  CDT  First version for Device Driver Library of CMP.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_cmp.h"
#include "hc32f460_utility.h"

#if (DDL_CMP_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup CmpGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter valid check for CMP Instances. */
#define IS_VALID_CMP(__CMPx__)                                                 \
(   (M4_CMP1 == (__CMPx__))                     ||                             \
    (M4_CMP2 == (__CMPx__))                     ||                             \
    (M4_CMP3 == (__CMPx__)))

/*!< Parameter valid check for CMP function */
#define IS_VALID_CMP_FUNCTION(x)                                               \
(   (CmpOutput      == (x))                     ||                             \
    (CmpOutpuInv    == (x))                     ||                             \
    (CmpVcoutOutput == (x)))

/*! Parameter validity check for edge sel. */
#define IS_VALID_EDGESEL(x)                                                    \
(   (CmpNoneEdge     == (x))                    ||                             \
    (CmpBothEdge     == (x))                    ||                             \
    (CmpRisingEdge   == (x))                    ||                             \
    (CmpFaillingEdge == (x)))

/*!< Parameter CMP FLT validity check for clock division. */
#define IS_VALID_FLTCLK_DIVISION(x)                                            \
(   (CmpNoneFlt       == (x))                   ||                             \
    (CmpFltPclk3Div1  == (x))                   ||                             \
    (CmpFltPclk3Div2  == (x))                   ||                             \
    (CmpFltPclk3Div4  == (x))                   ||                             \
    (CmpFltPclk3Div8  == (x))                   ||                             \
    (CmpFltPclk3Div16 == (x))                   ||                             \
    (CmpFltPclk3Div32 == (x))                   ||                             \
    (CmpFltPclk3Div64 == (x)))

/*!< Parameter validity check for INP4 SEL. */
#define IS_VALID_INP4SEL(x)                                                    \
(   (CmpInp4None      == (x))                   ||                             \
    (CmpInp4PGAO      == (x))                   ||                             \
    (CmpInp4PGAO_BP   == (x))                   ||                             \
    (CmpInp4CMP1_INP4 == (x)))

/*!< Parameter validity check for INP INPUT SEL. */
#define IS_VALID_INPSEL(x)                                                     \
(   (CmpInpNone        == (x))                  ||                             \
    (CmpInp1           == (x))                  ||                             \
    (CmpInp2           == (x))                  ||                             \
    (CmpInp3           == (x))                  ||                             \
    (CmpInp4           == (x))                  ||                             \
    (CmpInp1_Inp2      == (x))                  ||                             \
    (CmpInp1_Inp3      == (x))                  ||                             \
    (CmpInp2_Inp3      == (x))                  ||                             \
    (CmpInp1_Inp4      == (x))                  ||                             \
    (CmpInp2_Inp4      == (x))                  ||                             \
    (CmpInp3_Inp4      == (x))                  ||                             \
    (CmpInp1_Inp2_Inp3 == (x))                  ||                             \
    (CmpInp1_Inp2_Inp4 == (x))                  ||                             \
    (CmpInp1_Inp3_Inp4 == (x))                  ||                             \
    (CmpInp2_Inp3_Inp4 == (x))                  ||                             \
    (CmpInp1_Inp2_Inp3_Inp4 == (x)))

/*!< Parameter validity check for INM INPUT SEL. */
#define IS_VALID_INMSEL(x)                                                     \
(   (CmpInm1    == (x))                         ||                             \
    (CmpInm2    == (x))                         ||                             \
    (CmpInm3    == (x))                         ||                             \
    (CmpInm4    == (x))                         ||                             \
    (CmpInmNone == (x)))

/*!< Parameter validity check for CMP_CR channel. */
#define IS_VALID_CMP_CR_CH(x)                                                  \
(   (CmpDac1  == (x))                           ||                             \
    (CmpDac2  == (x)))

/*!< Parameter validity check for ADC internal reference voltage path. */
#define IS_VALID_ADC_REF_VOLT_PATH(x)                                          \
(   (CmpAdcRefVoltPathDac1 == (x))              ||                             \
    (CmpAdcRefVoltPathDac2 == (x))              ||                             \
    (CmpAdcRefVoltPathVref == (x)))

/*!< RVADC Write Protection Key. */
#define RVADC_WRITE_PROT_KEY                    (0x5500u)

/*!< Timer4x ECER register address. */
#define CMP_CR_DADRx(__DACx__)                                                 \
( (CmpDac1 == (__DACx__)) ? &M4_CMP_CR->DADR1 : &M4_CMP_CR->DADR2)

