RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_cmp.c
    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        /* Check parameter */
        DDL_ASSERT(IS_VALID_FLTCLK_DIVISION(enFltClkDiv));
        CMPx->CTRL_f.FLTSL = (uint16_t)enFltClkDiv;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get CMP filter sample clock division.
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval CmpNoneFlt                  Unuse filter
 ** \retval CmpFltPclk3Div1             PCLK3/1
 ** \retval CmpFltPclk3Div2             PCLK3/2
 ** \retval CmpFltPclk3Div4             PCLK3/4
 ** \retval CmpFltPclk3Div8             PCLK3/8
 ** \retval CmpFltPclk3Div16            PCLK3/16
 ** \retval CmpFltPclk3Div32            PCLK3/32
 ** \retval CmpFltPclk3Div64            PCLK3/64
 **
 ******************************************************************************/
en_cmp_fltclk_div_t CMP_GetFilterClkDiv(M4_CMP_TypeDef *CMPx)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP(CMPx));

    return (en_cmp_fltclk_div_t)CMPx->CTRL_f.FLTSL;
}

/**
 *******************************************************************************
 ** \brief Set CMP detection edge selection.
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] enEdgeSel               The CMP detection edge selection
 ** \arg CmpNoneEdge                    None edge detection
 ** \arg CmpRisingEdge                  Rising edge detection
 ** \arg CmpFaillingEdge                Falling edge detection
 ** \arg CmpBothEdge                    Falling or Rising edge detection
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ******************************************************************************/
en_result_t CMP_SetEdgeSel(M4_CMP_TypeDef *CMPx,
                                en_cmp_edge_sel_t enEdgeSel)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        /* Check parameter */
        DDL_ASSERT(IS_VALID_EDGESEL(enEdgeSel));
        CMPx->CTRL_f.EDGSL = (uint16_t)enEdgeSel;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get CMP detection edge selection.
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval CmpNoneEdge                 None edge detection
 ** \retval CmpRisingEdge               Rising edge detection
 ** \retval CmpFaillingEdge             Falling edge detection
 ** \retval CmpBothEdge                 Falling or Rising edge detection
 **
 ******************************************************************************/
en_cmp_edge_sel_t CMP_GetEdgeSel(M4_CMP_TypeDef *CMPx)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP(CMPx));

    return (en_cmp_edge_sel_t)CMPx->CTRL_f.EDGSL;
}

/**
 *******************************************************************************
 ** \brief Set CMP input sel
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] pstcInputSel            The CMP input selection structure
 ** \arg This parameter detail refer @ref stc_cmp_input_sel_t
 **
 ** \retval Ok                          Set successfully
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ******************************************************************************/
en_result_t CMP_InputSel(M4_CMP_TypeDef *CMPx,
                            const stc_cmp_input_sel_t *pstcInputSel)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check CMPx && pstcInputSel pointer */
    if ((IS_VALID_CMP(CMPx)) && (NULL != pstcInputSel))
    {
        /* Check parameter */
        DDL_ASSERT(IS_VALID_INMSEL(pstcInputSel->enInmSel));
        DDL_ASSERT(IS_VALID_INPSEL(pstcInputSel->enInpSel));
        DDL_ASSERT(IS_VALID_INP4SEL(pstcInputSel->enInp4Sel));

        if ((CmpInp4PGAO == pstcInputSel->enInp4Sel) ||
            (CmpInp4PGAO_BP == pstcInputSel->enInp4Sel))
        {
            if (M4_CMP3 != CMPx)
            {
                enRet = Ok;
            }
        }
        else if (CmpInp4CMP1_INP4 == pstcInputSel->enInp4Sel)
        {
            if (M4_CMP1 == CMPx)
            {
                enRet = Ok;
            }
        }
        else
        {
            enRet = Ok;
        }

        if (enRet == Ok)
        {
            CMPx->VLTSEL_f.CVSL = (uint16_t)pstcInputSel->enInpSel;
            CMPx->VLTSEL_f.RVSL = (uint16_t)pstcInputSel->enInmSel;
            CMPx->VLTSEL_f.C4SL = (uint16_t)pstcInputSel->enInp4Sel;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set CMP INP input selection
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] enInputSel              The INP input selection
 ** \arg CmpInpNone                     None input
 ** \arg CmpInp1                        INP1 input
 ** \arg CmpInp2                        INP2 input
 ** \arg CmpInp1_Inp2                   INP1 INP2 input
 ** \arg CmpInp3                        INP3 input
 ** \arg CmpInp1_Inp3                   INP1 INP3 input
 ** \arg CmpInp2_Inp3                   INP2 INP3 input
 ** \arg CmpInp1_Inp2_Inp3              INP1 INP2 INP3 input
 ** \arg CmpInp4                        INP4 input
 ** \arg CmpInp1_Inp4                   INP1 INP4 input
 ** \arg CmpInp2_Inp4                   INP2 INP4 input
 ** \arg CmpInp1_Inp2_Inp4              INP1 INP2 INP4 input
 ** \arg CmpInp3_Inp4                   INP3 INP4 input
 ** \arg CmpInp1_Inp3_Inp4              INP1 INP3 INP4 input
 ** \arg CmpInp2_Inp3_Inp4              INP2 INP3 INP4 input
 ** \arg CmpInp1_Inp2_Inp3_Inp4         INP1 INP2 INP3 INP4 input
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       CMPx is invalid
 **
 ******************************************************************************/
en_result_t CMP_SetInp(M4_CMP_TypeDef *CMPx, en_cmp_inp_sel_t enInputSel)
{
    en_result_t enRet = ErrorInvalidParameter;

