RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_cmp.c
    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        /* Check parameter */
        DDL_ASSERT(IS_VALID_INPSEL(enInputSel));
        CMPx->VLTSEL_f.CVSL = (uint16_t)enInputSel;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set CMP INP input selection
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval CmpInpNone                  None input
 ** \retval CmpInp1                     INP1 input
 ** \retval CmpInp2                     INP2 input
 ** \retval CmpInp1_Inp2                INP1 INP2 input
 ** \retval CmpInp3                     INP3 input
 ** \retval CmpInp1_Inp3                INP1 INP3 input
 ** \retval CmpInp2_Inp3                INP2 INP3 input
 ** \retval CmpInp1_Inp2_Inp3           INP1 INP2 INP3 input
 ** \retval CmpInp4                     INP4 input
 ** \retval CmpInp1_Inp4                INP1 INP4 input
 ** \retval CmpInp2_Inp4                INP2 INP4 input
 ** \retval CmpInp1_Inp2_Inp4           INP1 INP2 INP4 input
 ** \retval CmpInp3_Inp4                INP3 INP4 input
 ** \retval CmpInp1_Inp3_Inp4           INP1 INP3 INP4 input
 ** \retval CmpInp2_Inp3_Inp4           INP2 INP3 INP4 input
 ** \retval CmpInp1_Inp2_Inp3_Inp4      INP1 INP2 INP3 INP4 input
 **
 ******************************************************************************/
en_cmp_inp_sel_t CMP_GetInp(M4_CMP_TypeDef *CMPx)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP(CMPx));

    return (en_cmp_inp_sel_t)CMPx->VLTSEL_f.CVSL;
}

/**
 *******************************************************************************
 ** \brief Set CMP INM input selection
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] enInputSel              The INP input selection
 ** \arg CmpInmNone                     None input
 ** \arg CmpInm1                        INM1 input
 ** \arg CmpInm2                        INM2 input
 ** \arg CmpInm3                        INM3 input
 ** \arg CmpInm4                        INM4 input
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       CMPx is invalid.
 **
 ******************************************************************************/
en_result_t CMP_SetInm(M4_CMP_TypeDef *CMPx, en_cmp_inm_sel_t enInputSel)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        /* Check parameter */
        DDL_ASSERT(IS_VALID_INMSEL(enInputSel));
        CMPx->VLTSEL_f.RVSL = (uint16_t)enInputSel;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get CMP INM input selection
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval CmpInmNone                  None input
 ** \retval CmpInm1                     INM1 input
 ** \retval CmpInm2                     INM2 input
 ** \retval CmpInm3                     INM3 input
 ** \retval CmpInm4                     INM4 input
 **
 ******************************************************************************/
en_cmp_inm_sel_t CMP_GetInm(M4_CMP_TypeDef *CMPx)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP(CMPx));

    return (en_cmp_inm_sel_t)CMPx->VLTSEL_f.RVSL;
}

/**
 *******************************************************************************
 ** \brief Set CMP INP4 input selection
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 ** \param [in] enInputSel              The INP input selection
 ** \arg CmpInp4None                    None input
 ** \arg CmpInp4PGAO                    PGAO output
 ** \arg CmpInp4PGAO_BP                 PGAO_BP output
 ** \arg CmpInp4CMP1_INP4               CMP1_INP4
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       CMPx is invalid.
 **
 ** \note                               Inp4 Selection is valid only for M4_CMP1
 **                                     and M4_CMP2.
 **
 ******************************************************************************/
en_result_t CMP_SetInp4(M4_CMP_TypeDef *CMPx,en_cmp_inp4_sel_t enInputSel)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameter */
    DDL_ASSERT(M4_CMP3 != CMPx);
    DDL_ASSERT(IS_VALID_INP4SEL(enInputSel));

    /* Check CMPx pointer */
    if (IS_VALID_CMP(CMPx))
    {
        CMPx->VLTSEL_f.C4SL = (uint16_t)enInputSel;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get CMP INP4 input selection
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval CmpInp4None                 None input
 ** \retval CmpInp4PGAO                 PGAO output
 ** \retval CmpInp4PGAO_BP              PGAO_BP output
 ** \retval CmpInp4CMP1_INP4            CMP1_INP4
 **
 ** \note                               Inp4 Selection is valid only for M4_CMP1
 **                                     and M4_CMP2.
 **
 ******************************************************************************/
en_cmp_inp4_sel_t CMP_GetInp4(M4_CMP_TypeDef *CMPx)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP(CMPx));

