RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_cmp.c
    return (en_cmp_inp4_sel_t)CMPx->VLTSEL_f.C4SL;
}

/**
 *******************************************************************************
 ** \brief Get CMP output state
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval CmpOutputLow                Compare output Low "0"
 ** \retval CmpOutputHigh               Compare output High "1"
 **
 ******************************************************************************/
en_cmp_output_state_t CMP_GetOutputState(M4_CMP_TypeDef *CMPx)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP(CMPx));

    return (en_cmp_output_state_t)(CMPx->MON_f.OMON);
}

/**
 *******************************************************************************
 ** \brief Get CMP INP state
 **
 ** \param [in] CMPx                    Pointer to CMP instance register base
 ** \arg M4_CMP1                        CMP unit 1 instance register base
 ** \arg M4_CMP2                        CMP unit 2 instance register base
 ** \arg M4_CMP3                        CMP unit 3 instance register base
 **
 ** \retval CmpOutputLow                Compare output Low "0"
 ** \retval CmpOutputHigh               Compare output High "1"
 **
 ******************************************************************************/
en_cmp_inp_state_t CMP_GetInpState(M4_CMP_TypeDef *CMPx)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP(CMPx));

    return (en_cmp_inp_state_t)(CMPx->MON_f.CVST);
}

/**
 *******************************************************************************
 ** \brief Initialize CMP DAC
 **
 ** \param [in] enCh                    CMP DAC channel
 ** \arg CmpDac1                        CMP CR DAC channel: DAC1
 ** \arg CmpDac2                        CMP CR DAC channel: DAC2
 ** \param [in] pstcInitCfg             Pointer to CMP DAC configure structure
 ** \arg This parameter detail refer @ref stc_cmp_dac_init_t
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       enCh is invalid.
 **
 ******************************************************************************/
en_result_t CMP_DAC_Init(en_cmp_dac_ch_t enCh,
                            const stc_cmp_dac_init_t *pstcInitCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if ((IS_VALID_CMP_CR_CH(enCh)) && (pstcInitCfg != NULL))
    {
        /* Check parameter */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->enCmpDacEN));

        M4_CMP_CR->DACR &= (uint16_t)(~(1ul << enCh));    /* Disable DAC */

        *(__IO uint8_t *)CMP_CR_DADRx(enCh) = pstcInitCfg->u8DacData; /* Set DAC data */

        if (Enable == pstcInitCfg->enCmpDacEN)
        {
            M4_CMP_CR->DACR |= (uint16_t)(1ul << enCh); /* Enable DAC */
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief De-Initialize CMP DAC
 **
 ** \param [in] enCh                    CMP DAC channel
 ** \arg CmpDac1                        CMP CR DAC channel: DAC1
 ** \arg CmpDac2                        CMP CR DAC channel: DAC2
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       enCh is invalid.
 **
 ******************************************************************************/
en_result_t CMP_DAC_DeInit(en_cmp_dac_ch_t enCh)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameter */
    if (IS_VALID_CMP_CR_CH(enCh))
    {
        M4_CMP_CR->DACR &= (uint16_t)(~(1ul << enCh));
        *(__IO uint8_t *)CMP_CR_DADRx(enCh) = 0u;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable CMP DAC working
 **
 ** \param [in] enCh                    CMP DAC channel
 ** \arg CmpDac1                        CMP DAC channel: DAC1
 ** \arg CmpDac2                        CMP DAC channel: DAC2
 ** \param [in] enCmd                   The CMP DAC function state
 ** \arg Disable                        Disable CMP DAC working
 ** \arg Enable                         Enable CMP DAC working
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       enCh is invalid.
 **
 ******************************************************************************/
en_result_t CMP_DAC_Cmd(en_cmp_dac_ch_t enCh, en_functional_state_t enCmd)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameter */
    if (IS_VALID_CMP_CR_CH(enCh))
    {
        if(Enable == enCmd)
        {
            M4_CMP_CR->DACR |= (uint16_t)(1ul << enCh);
        }
        else
        {
            M4_CMP_CR->DACR &= (uint16_t)(~(1ul << enCh));
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set DAC data register value
 **
 ** \param [in] enCh                    CMP DAC channel
 ** \arg CmpDac1                        CMP CR DAC channel: DAC1
 ** \arg CmpDac2                        CMP CR DAC channel: DAC2
 ** \param [in]  u8DacData              DAC data register value
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       enCh is invalid.
 **
 ******************************************************************************/
en_result_t CMP_DAC_SetData(en_cmp_dac_ch_t enCh, uint8_t u8DacData)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameter */
    if (IS_VALID_CMP_CR_CH(enCh))
    {
        *(__IO uint8_t *)CMP_CR_DADRx(enCh) = u8DacData;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get DAC data register value
 **
 ** \param [in] enCh                    CMP DAC channel
 ** \arg CmpDac1                        CMP CR DAC channel: DAC1
 ** \arg CmpDac2                        CMP CR DAC channel: DAC2
 **
 ** \retval                             DAC data register value
 **
 ******************************************************************************/
uint8_t CMP_DAC_GetData(en_cmp_dac_ch_t enCh)
{
    /* Check parameter */
    DDL_ASSERT(IS_VALID_CMP_CR_CH(enCh));

    return *(__IO uint8_t *)CMP_CR_DADRx(enCh);
}

/**
 *******************************************************************************
 ** \brief Set ADC internal reference voltage path
 **
 ** \param [in] enRefVoltPath           ADC internal reference voltage path
 ** \arg CmpAdcRefVoltPathDac1          ADC internal reference voltage path: DAC1
 ** \arg CmpAdcRefVoltPathDac2          ADC internal reference voltage path: DAC2
 ** \arg CmpAdcRefVoltPathVref          ADC internal reference voltage path: VREF
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       enRefVoltPath is invalid.
 **
 ******************************************************************************/
en_result_t CMP_ADC_SetRefVoltPath(en_cmp_adc_int_ref_volt_path_t enRefVoltPath)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameter */
    if (IS_VALID_ADC_REF_VOLT_PATH(enRefVoltPath))
    {
        M4_CMP_CR->RVADC = RVADC_WRITE_PROT_KEY;  /* Release write protection */
        M4_CMP_CR->RVADC =  enRefVoltPath;        /* Set reference voltage path */
        enRet = Ok;
    }

    return enRet;
}

//@} // CmpGroup

#endif /* DDL_CMP_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
